Revit 2027 API
TessellatedShapeBuilder.Fallback Property
 Defines acceptable fallback if the desired type of geometry can't be built.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TessellatedShapeBuilderFallback Fallback { get; set; }
Public Property Fallback As TessellatedShapeBuilderFallback
	Get
	Set
public:
property TessellatedShapeBuilderFallback Fallback {
	TessellatedShapeBuilderFallback get ();
	void set (TessellatedShapeBuilderFallback value);
}
member Fallback : TessellatedShapeBuilderFallback with get, set
Property Value
TessellatedShapeBuilderFallback
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
TessellatedShapeBuilder Class
Autodesk.Revit.DB Namespace